#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "57e7df2d7008c3c7b65eb26cdda799c5" -> "b958d4d315534affaee56b6fb6470a54"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "3788f3ca9847cb837dbd887e44d7aab9" -> "e46bf4f1a9f14a57bf1a683dc781178a"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "50cfe056180b1f3ced2c0fb951fb6c3d" -> "c49a61697b86a24b49d2092d40f705ea"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3338b0ae0fabef57b7178c9412547a20" -> "236837870dfaa3aa34a338ca2d9f85d1"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "4128595fb4896322d51a0f88da9865a2" -> "6e381cc41007924eef1fa6b7e1c845ce"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "4d5a2ed77bc7429d702c26f61da5cbf4" -> "9284ffb06e6181c8fb61ecb32562d44a"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "4cad8c9e52c160d034dee79d9aeb4e19" -> "c63826c066769ff51267938dc410a957"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "81b6db2cec02158a020b21f57782af4e" -> "0292e09fb3da8e2c88c571bf379c1ba3"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "82b1947b91029fb01001a5f73695b2a4" -> "12550bf1a3d4c6be40bf61e96dfcadbd"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "b92ffb7d131303149f999989018ac2d0" -> "24aee36a71714273941a0307805dcb91"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "30efeda4f726b03946fc99aba22dacb2" -> "7cc92c3ab24ea6814ee98eefbcf3c65f"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "0094a083cc567a2205f013ad94864190" -> "53f36067723fc62b392942f2f9d6edee"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "b6054a6d436b75f795c5f95343aee14e" -> "0c96e606d1d5439f9ab437aedb5215da"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "b18d05f276b6a4cb86ba1e43e9082b20" -> "eb3fe72d2be995e26c8aec02878627c3"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "c43d1e3824da4a3b97af210ea673eb0e" -> "a1625b7f8d24a5abd3a3055fb09601dd"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "73a3525e82c21ca7deb6837e6cf33b6e" -> "4138612100be3c58ecb6321e564938e4"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "17a6ba5c446649365c7596118d0160d3" -> "8f06305677385fb5c154c6fca1fc9ef7"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "c9c8aafa641cc76599683a4eb6c0c1a1" -> "d56e01ae4af2b2152cce09afe594859f"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "bff862d2d38f219185c99699dfa1032c" -> "6ab934a9d85e90a92781bec65d602876"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "4847992625bfadd227ff0bd118552f64" -> "069629f92ddfd925d4b39fa7e3fc15b9"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "843f85011caed13e338e200803aa1b21" -> "0c80721228ef97464a31dc1139f2b943"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "329024f0a63139263902c9e15e0cee2c" -> "17ac6a2ad81bb5bad97ec1af4cf7a15c"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "729dfcb9ef73047e0fb962337a133876" -> "6eff3b83ee9355c73d0b7d0e89a28583"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7feffae0a98bbadffeec6a058b6f1005" -> "ee072423c7ef2a73334eb8266d48d38f"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "faa82e5a9ae8b0ddd4db9bc742214b84" -> "1ebd2eecfc041a8eefd91e9af0c12f9c"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "73ae59aa85ace038963371d0e2fa8da1" -> "31660ab17ff0b10055809e0823bf36d7"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "4e65a87c18a074fcdbc7901add4798fe" -> "46b9cdb4f954682061de72c2e07256dd"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "6ba2428a7658baca45fb9bc9b395c630" -> "12674eb90bae7e14c29499bc70e70336"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "ceaf4e0abf3fbe0e6084d53e18d4e887" -> "892c5f84ed8eefb2589e4f1dfec03114"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "d61b469d306a7979ef5b8cf766e37f2d" -> "d9aed042961410c7d670d53d08a894f8"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e5a81844d54291b93e7f5be1aaf55e2c" -> "eaeac4ce926cdc80a6eb584a71a2364f"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "93ef87cfd24f93ebfc7475296a4b212b" -> "5d88786105604a123222e10b34100c75"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "d389acca54530a36b5461c3b72f7ddaf" -> "31bb09ff5c56d1976553373c665620da"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "59b202daae3eb987a792b3235ba33a9f" -> "13e59b45a499f078eced6ef79163fd46"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7ffa0824538bb8aaa7c1e01e758bce4a" -> "3289e9580d650dcb4ada75bb19242ebd"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "410744dd310b75ddd72c69d9c692a0c9" -> "9df93e67718de702d55dd71b2c1e96bb"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "65b7280c8faa0d2a3d1054f667b8fea0" -> "44c4612da6f2fb119d3b786c9fadfb38"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "b25a9d77a1b23a599e80d1a43d6077a7" -> "a38503d1a01ec41a2039995c57d785e9"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "45b55f3b8cd5f52c117f04c3a028e2e8" -> "dbf50b5c44a55eb024e8bf9d7ded3d7a"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "8e99825a2b9d9bbd16fb92d155271739" -> "3d86aa8899c1b28bee893f86bb7d32dd"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0c4d1a4b9125b515e0c8ec194bce82ac" -> "b4ff1b36a4938909f3537395ccfea2ae"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "a82aa38a051f8139e9ac98a867339815" -> "2e32818f6940e2616ffe67bbc04b97e6"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "d19aaae81f73f1a9ffd0e1ccc0473c21" -> "91f176474457e427742acdc482565e39"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "c9202f098bd7304518dd5e09b9ad78ee" -> "7a9612cc809af36771a73490354be2d9"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "571f0a65a82dd60396a6ca7290ef34d1" -> "d1fbd540d3b02d3f9cc47f1b5cfd1b79"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "406f4a95ec5b6dfc867ccfb975280aaa" -> "6c8971be4b4722b567c654205af6533b"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "bcdf3a62cb64a2e81e65c6902814564c" -> "0a75a1942f386a330514ca6f25b35994"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwm+aoys4laM3glwLemKzM31dQ0S0TfzM8OakW2iMdU=" -> "LNsRK0s+P+ekeKC5mth1BkRuQXHQfiekbAz0FHHRXtg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "m99kbbBh/8Q7UC1QfN2CVFAcRsqXVwQIbm/tvu263D4=" -> "/StjQXAfKSFZ3WCNAkIgfKtYBH01w/leqoEluNHQrws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "TiBSblOERlt/sHuMucn8SpfVwQJnf1QVqgxSQtDv4Ks=" -> "SsDDeTMyEt3RC1kGiPTKAUxqS8TZzS6BVFVX92FhNig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "lKJ4ChD3apQMyojKFi1pRATz7B7ueuKVyxNYhixuDGg=" -> "Kioc3C9ZlqkKaAS6TQvouFpCVQ9iBtAznjt5+zV1tNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "zHFS1w/N4akZ+41NlR/AF21rCMZyuNSwO1xjwcCPMoM=" -> "iBrQ5SduQ4dkcqhU5ZWkGXX0d6B2Ud0+H1HiMtjCM9A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "+oga4d977S0jr5/DOZ1veVxyJZhk3NXZNK4nYJC9tFw=" -> "zM3lgjmlwHuuOOGLuIE4rGiNA9dfKsy4ay1SJTeoO6o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "1h9QqJPG4IQpGmZ0i6f6yuQdbz/8dPGuwl0oobhCCLY=" -> "QjGWlIfjxyQg5xJnDw94ZZ1cPnE4ZWvdTYQlWxVircY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "dy0wEB93P2GPMkNkfihQqZwUzPkSHGyez2jaoaMWVKE=" -> "sYANgBq9TFU9SIH9kEAXxnwyMnwnj2Cre1o6nMcjGmo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "mNftg8hYhgqvf7yDw8/NuyDB8idr1TMwcrZEclNwoeQ=" -> "Fn3PlIBOsh06NpLQYsbfzxIH93t0Au0ZXlwqABWPODM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "I3IpC2DozXpvIbxZme9P0SSO0e1dzGJgjAo3FG9n/SY=" -> "wI4wUzK6Zn6EflWSvSRUVgQAesYagP/S93o7rRU+oKI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bapcxv+aAgBT+OaCYQnOLleDT29WTZl9FmiNGovy2cM=" -> "jFQMalCHuQ2ZbncQu45q3H/5uKR5EXjHoXisspW3kzk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "YklKY07FPBupAVSJ/tNsTlvmB4Cx5TwC6nX/9YzsNGU=" -> "kTQrnPf5bLkO4HOPGqxcZxQKmRIT/PSwGpP/YZ2Ao48="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "4EYGTiheQ5QO5OquoKW08kPFo5Atk5DE+/Ho6U5R/Og=" -> "gp8MHREaW1+Qvox/SSCDbz6cVJBlkShgXesjAdWYYMw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "VQ49ajF8i8BCcwWYMbTry8CIajm/WN9JyfpBaEZ7lDI=" -> "5OnhsOK5hgJxB8fq+0XhnuZnH8dTqyKBDKAIvfFGYq0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "9BYQf1zMDeQ7VxmEz6/3VDab8Do7P2ddG9Nbd9UM/ME=" -> "K5Hz++G3hdfhwwcuujhG5gcF/Mz1T7yo+2WBas/yNmw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "qiHWduLehLrYvBy0ALSwz3thl5SVJybBvJXZo22aLeA=" -> "aOIXm3qfPFCUgZz9LNnETy6G1cdWGQGOK3WnF6gdiqg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "bQQUrDU0T+ow8iA0ugTAElOcSXXL46NgKiTLqf5w40k=" -> "zf+DpNGxpuERiGZTNmgIKdTrHEamH5VkOdiozJisyxM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hm8Fq6ensImSqGEBzASJQemVpaQhcB26utSQWNm+69g=" -> "FXc4UJ44XueAwlAdzOKfiqyPzb9w+bhDrgM2LSpcP98="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7vxwMI0VC+WgmYBrV+PsyMwxBx1RQyFqE5IcEqwGm8=" -> "4NwDkXuCihRpeCWhOIFn6frYP0SfXDvuSwLjRK8dyyY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWqGCw6XrIyE0u/IUJSE0A6JJu8Z25yiU6Ga+2Kk2rA=" -> "A3JQCVpYGPNV6yVjKhfpBvbzYIfjOTLf6+Hn0Y1ZYlE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "cD9WEkBlxLYRxNUPk5cNRukH+lGUBTQKxKvPn9Ho5Oc=" -> "35K6fNujYCljJqp6zqr4FQgdycu9r5i97rqaJKhOlV0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "rJqfftO8Se8mWFrdtNiTao2JTpL3+aY4TZ3MnSxGWUw=" -> "WoiV+YYYwjgH8EFO1x+9/keY6VhsLDQ+jKqESP/jlEs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "krIkaCfsFGAVlqmICq2WWHv8IFTXudxy3FJV6YbHuBg=" -> "IEXgacosKqAonGGnXxNJdDM5WnY0j6K2hBPsMjc+d1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8iWEQ25RGECFbHbOxuzv3ZB2qEHc/l/7cBAjWl9cMY=" -> "Lln2ipLCAb49NyIYMO/rpQHDfGZFxz2NidBhOfyVmcY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBjkuWbuyOKg9OWX6gY0Su80gQD99nJ3Z1VaAqrZ6dM=" -> "bClsntcaplO+nWEa80Z6rxNG7DQ0UCnDnB3JVILF2nY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "beXM3QnGZjyKdxt+5bqtjwHcyGgPA4w/pNbLcUelmk4=" -> "X202eOxXyw97FnsP6HgeaKV6BUi2wfYAuK+o9k7NRmI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "8B//IRMBXi6bNtohBuIRcGlVyyIAKz86Eyx2XZudSSQ=" -> "H5rzesG0b7uQ8IxZ+7arO1acSExUz4IFEyzZUfewnyM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "lC1FmgkT5ZQbpXXEOMskDJpQjlzBPiklYBCd53IGo6s=" -> "rsExgPsgqyobat2M5GdXhkjuVRHjOL/Ad4VBHNXbGhw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "zcQ5pjPZwrGTqp/C89uj9jV3lUiiSUflCSvhmbJk1Z4=" -> "wdFZi3e9kg86Ivj/vmNbJ0Qsx6q9u3TOhJcndiM1Z1U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "6hkOPDDfAMSHBjbFtp+H2Hvdb4sMibwVy+sxoOQ84KM=" -> "Wh7R8FzWSNUfs7dqg3aaryjV6Atga498MyfYAkTQ+Fc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-10T21:04:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "dx81ziWWu7uB8T42bE5T3OOTfVjd2Pj8slt1f51uo2s=" -> "G7kZVNf4DDueMop5qttH8k2Yl/9ox8PtkB1AKruZ578="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "aa+vWUHgeNxVQHVVD8Gj5VpG/hEkmwQANxCApQzAoLg=" -> "uKLGqfBkBMI2S4MaJ0AloZqlYT8dCxCp0I60eUYiqs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "ObiT14FEby8/jmkhvjoeJtbBpOHtqaNdnu9rJ2OI/y0=" -> "CAtvP1xANJDrHRAUpcBjqglQDus5tIJwMGNn3i+oP5g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ODBb4BnMAwn3pVIokHyP4gdxVjyDsNmP6WbyH1pESjc=" -> "gfcW4n8PimViTp5Uz0+Ovqkrm/FeZkAcd06dFSpVud8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "cZ0WGzTSTXuIC/sFj0YOBm8ztcGHIxJOqgvfBdmt+Sk=" -> "3Bj4YQj8qDXvn1vQVw788wVKQkdMxhyxKWxEaWcBbtg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "0SCcUONwwVG00AeW3fUIqRxiNK51RvWR5RF3KnfkBWc=" -> "+QDbIGQv7pVXTUbUZLv2FdEKDZDYsSC6UwZjBQRYP/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "F5Bt66sSh13xbtA2O8peJFnWwpsofbM0/zOWM4TbMFw=" -> "rHpQCHPOEmHCM7+WzCEPW0I6xGliSPre2fwny9yiH1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfiZ/qkphf9P0mQvpw1PmJXwf8hfw5Mjijam9PEsv/0=" -> "KcnEVcs8ErsxPhYZPKViW8509prOxzt2pdV+7uTIATQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "C3IqP8JCpZctg8T0Y0Mjc8j4KKT+f0Ay5K8Jv84C0nA=" -> "YIwSC8Ckz6CvZvD6znzTsey1SfxaGd0zCqP/t7WZsIQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvZzWvomp7sD//F/8bh/dCPwLg9OjaS/0PSYZzHz5F0=" -> "0GsyHTFny4+wDnNIcpv0ZS5ISj5pV5RbvC6hyK5tFIk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmQCYcvj4YCYnCa8nPjCdA8lZNhk7MLJsvzdZF8e10M=" -> "C9Pic+vX/r7RsSFEeRm2mK4UTmmipMnH1FIRt9A3ws8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "/aOdUCsru9JBvpom/W/5LPfl8eaOAaBfwo5eG+/rKEs=" -> "aLcx0J2tzQ1GHm+2Oed2GuEoAz0E7kAXJKfuMufN5i8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gqoo3Sb/iM7P25W3RFv6LRii8lUfhqXxPf+wF7YyJ2Y=" -> "jumPrG6cDD61qxpxZ+UP7NXY05zG2U1MuMD2xhAXga0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "g72H21hzjs5j+x0s/n1xP8hBuwU3VQ/c+S8NacRWwRk=" -> "tFHW0CHwmpTJHfmvXXpsPQtMfBzopMY2kiqOCpZOd/s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "QUA1r8+lCwOGtqRRbBKW19SQa33cWhdDO3cW6PFXPbI=" -> "A+SFluXFuzziV4fYf96DcPyaF5nNjgvpm+QCHrCB8Ac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jt04wz7VQqw+29CemxqdsUdykAe06EojceTyr9p+lKY=" -> "UNH315+koRCgA/MP/KGoMPC+3AHG02tbfWJLcnW0d/0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-03T07:41:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "30bbte" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.quarters_report_method will be updated in-place
  ~ resource "aws_api_gateway_method" "quarters_report_method" {
        id                   = "agm-kb7gblbu69-gfvl0r-GET"
      ~ request_parameters   = {
          + "method.request.querystring.period"           = false
          ~ "method.request.querystring.years"            = true -> false
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 96 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*